{
  "Locale": {
    "en": "English",
    "tr": "Türkçe",
    "es": "Español"
  },
  "Theme": {
    "darkMode": "Dark Mode",
    "lightMode": "Light Mode"
  },
  "Common": {
    "welcome": "Welcome",
    "goodbye": "Good Bye",
    "learnMore": "Learn More",
    "seeAll": "See All"
  },
  "Navbar": {
    "home": "Home",
    "corporate": "Corporate",
    "services": "Services",
    "projects": "Projects",
    "hse": "HSE",
    "quality": "Quality",
    "contact": "Contact",
    "careers": "Careers"
  },
  "Footer": {
    "copyRight": "© 2025 Karya Engineering. All rights reserved.",
    "privacyPolicy": "Privacy Policy",
    "termsOfService": "Terms of Service"
  },
  "Home": {
    "Welcome": {
      "title": "Karya Engineering",
      "subtitle": "Crafting Excellence in Every Project",
      "motto": "Innovate. Implement. Inspire.",
      "explore": "EXPLORE"
    },
    "About": {
      "sectionTitle": "Why Karya",
      "title": "Forged Excellence in Every Project",
      "description": "Since 1919, our reputation has been founded on building quality electrical and communications installations, building value for clients, and building people in a diverse, safe, and inclusive environment. We serve customers with highly complex construction projects, who rely on us for knowledge, scalability, quality, and safety. Infused with a sense of shared ownership, our entire team focuses on building relationships that deliver results."
    },
    "Performance": {
      "sectionTitle": "What We Achieved",
      "title": "Delivering Outstanding Results",
      "description": "Our team is comprised of unique individuals who bring the intelligence, talent and skill required to make Rosendin one of the nation’s finest electrical contractors. If you’ve got what it takes to join us, we want to hear from you.",
      "yearsOfExperience": "Years of Experience",
      "projectsCompleted": "Projects Completed",
      "employees": "Employees",
      "cablesInstalled": "Cables Installed"
    },
    "Projects": {
      "sectionTitle": "Our Projects",
      "title": "Leading Projects Across Multiple Sectors",
      "viewAllProjects": "View All Projects",
      "Projects": {
        "Alpha": {
          "title": "Project Alpha",
          "location": "New York, USA",
          "description": "A groundbreaking infrastructure project that redefines urban connectivity. Innovative solutions for modern architectural challenges. A groundbreaking infrastructure project that redefines urban connectivity. Innovative solutions for modern architectural challenges. A groundbreaking infrastructure project that redefines urban connectivity. Innovative solutions for modern architectural challenges."
        },
        "Beta": {
          "title": "Project Beta",
          "location": "Los Angeles, USA",
          "description": "Innovative solutions for modern architectural challenges. Innovative solutions for modern architectural challenges. Innovative solutions for modern architectural challenges. Innovative solutions for modern architectural challenges. Innovative solutions for modern architectural challenges. Innovative solutions for modern architectural challenges."
        },
        "Gamma": {
          "title": "Project Gamma",
          "location": "Chicago, USA",
          "description": "Sustainable development for future generations. Innovative solutions for modern architectural challenges. Sustainable development for future generations. Innovative solutions for modern architectural challenges. Sustainable development for future generations. Innovative solutions for modern architectural challenges."
        },
        "Delta": {
          "title": "Project Delta",
          "location": "Houston, USA",
          "description": " Revolutionizing urban landscapes. Innovative solutions for modern architectural challenges. Revolutionizing urban landscapes. Innovative solutions for modern architectural challenges. Revolutionizing urban landscapes. Innovative solutions for modern architectural challenges."
        },
        "Epsilon": {
          "title": "Project Epsilon",
          "location": "San Francisco, USA",
          "description": "Cutting-edge technology integration in commercial spaces. Innovative solutions for modern architectural challenges. Cutting-edge technology integration in commercial spaces. Innovative solutions for modern architectural challenges. Cutting-edge technology integration in commercial spaces. Innovative solutions for modern architectural challenges."
        }
      }
    },
    "Blogs": {
      "hseBlog": {
        "motto": "We Care for Your Safety",
        "title": "Enhancing Workplace Safety",
        "subtitle": "Health, Safety, and Environment Practices",
        "description": "At Karya Engineering, we prioritize the health and safety of our employees and clients. Our comprehensive HSE practices ensure a safe working environment, minimizing risks and promoting well-being."
      },
      "qualityBlog": {
        "motto": "Commitment to Excellence",
        "title": "Quality Assurance in Engineering",
        "subtitle": "Delivering Superior Quality",
        "description": "Quality is at the core of everything we do at Karya Engineering. Our rigorous quality assurance processes guarantee that every project meets the highest standards, ensuring client satisfaction and long-term success."
      }
    },
    "Services": {
      "sectionTitle": "Our Services",
      "title": "What We Provide",
      "subtitle": "Engineering Solutions",
      "description": "Karya Engineering offers a comprehensive range of services tailored to meet the diverse needs of our clients. Our expertise spans multiple sectors, ensuring innovative solutions and exceptional results.",
      "linkText": "Discover our full range of services and how we can assist with your next project.",
      "seeProject": "See Projects",
      "ElectricalPower": {
        "title": "ELECTRICAL POWER"
      },
      "UndergroundUtilities": {
        "title": "UNDERGROUND UTILITY"
      },
      "RenewableEnergy": {
        "title": "RENEWABLE ENERGY"
      },
      "Specialty": {
        "title": "SPECIALTY"
      }
    },
    "References": {}
  }
}
